[M_PoeticLicense MissionDefinition]
MissionDescription="Scooter wants to write a love poem, but he needs inspiration. He's asked you to explore Pandora and find natural (or unnatural) landmarks that can inspire him to complete his poem and win the heart of a woman named Daisy. "
TurnInDescription="Everyone's a critic."

[M_PoeticLicense:MissionObjectiveSetDefinition_3 MissionObjectiveSetDefinition]
MissionDescriptionOverride="Scooter wants to write a love poem, but he needs inspiration. He's asked you to explore Pandora and find natural (or unnatural) landmarks that can inspire him to complete his poem, and win the heart of a woman named Daisy. You've found all the poetic inspiration he needs; now you just have to return to him so he can give you the poem, to give to Daisy."

[M_PoeticLicense:MissionObjectiveSetDefinition_4 MissionObjectiveSetDefinition]
MissionDescriptionOverride="Scooter wants to write a love poem, but he needs inspiration. He's asked you to explore Pandora and find natural (or unnatural) landmarks that can inspire him to complete his poem, and win the heart of a woman named Daisy. With the poem complete, Scooter now wants you to deliver the poem to Daisy on his behalf."
